export const DEPARTMENT_MAP: Record<string, string> = {
  '2399': 'คณะนิเทศศาสตร์',
  '2370': 'สำนักพัฒนาการเรียนรู้',
  '1000': 'คณะบริหารธุรกิจ',
  '1100': 'คณะบัญชี',
  '1200': 'คณะเศรษฐศาสตร์',
  '1300': 'คณะนิติศาสตร์',
  '1400': 'คณะมนุษยศาสตร์และและการจัดการการท่องเที่ยว',
  '1500': 'คณะนิเทศศาสตร์',
  '1600': 'คณะวิทยาศาสตร์และเทคโนโลยี',
  '1700': 'คณะวิศวกรรมศาสตร์',
  '1800': 'คณะศิลปกรรมศาสตร์',
  '1900': 'คณะการสร้างเจ้าของธุรกิจและการบริหารกิจการ',
  '2000': 'วิทยาลัยนานาชาติ',
  '2100': 'วิทยาลัยนานาชาติจีน',
  '2200': 'สถาบันภาษา',
  '2300': 'สำนักทะเบียนและประมวลผล',
  '2400': 'สำนักหอสมุด',
  '2500': 'สำนักกีฬา',
  '2600': 'สำนักกิจการนักศึกษา',
};

export const getDepartmentName = (dept: string | undefined): string => {
  if (!dept) return 'Not specified';
  return DEPARTMENT_MAP[dept] || dept;
};
